<template>
    <div class="school">
        <div class="schoold-list">
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/滨州学院.png">
                <div class="section">
                    <h1 class="title1">滨州学院</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;滨州学院（Binzhou
                        University），位于山东省滨州市，是由山东省人民政府举办、教育部批准成立的一所全日制普通本科院校，由山东省教育厅、滨州市人民政府共建，是山东省硕士学位授予A类立项建设单位。
                        学院前身是始建于1954年的北镇师范学校；1983年更名为滨州师范专科学校；2004年5月，经教育部批准，改建为滨州学院。 2021年1月，学校获批山东省应用型本科高校建设首批支持单位。2021年10月，学校正式成为硕士学位授予单位
                        截至2023年6月，学校占地面积133.15万平方米，校舍建筑面积56.71万平方米，教学科研仪器设备总值2.9亿元，图书馆纸质图书197.36万册，电子图书126.17万册；设有二级学院19个、直属科研机构3个，开设本科专业59个、本科中外合作办学项目2个；拥有硕士专业学位点2个；有专任教师1119人，全日制普通在校生18000余人。
                    </h4>
                </div>
            </van-col>
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/菏泽学院.png">
                <div class="section">
                    <h1 class="title1">菏泽学院</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;菏泽学院（Heze
                        University）位于山东省菏泽市，是一所全日制普通本科高校，是数据中国“百校工程”项目建设院校， 由山东省教育厅与菏泽市人民政府共建。] 
                        菏泽学院的前身是创建于1949年的冀鲁豫区第二师范学校，历史上曾更名为平原省立菏泽师范学校、山东省菏泽第一师范学校、菏泽师范专科学校。2002年，菏泽师范专科学校、菏泽教育学院、菏泽广播电视大学3所学校合并，同时并入菏泽师范学校、菏泽农业学校，筹建菏泽学院。2004年，教育部正式批准更名为菏泽学院。2011年，单县幼儿师范学校、郓城幼儿师范学校并入菏泽学院。2017年，学校成为省级硕士培育建设单位。
                        截至2023年6月，学校建有4个校区，占地面积1436亩，建筑面积63万余平方米，教学科研仪器设备总值2.3亿元，馆藏纸质图书231万册、期刊279种，电子图书252万册；设有21个教学单位，开设66个本科专业；有在职教职工1696人，其中专任教师1211人，全日制本专科在校生2.6万余人。
                    </h4>
                </div>
            </van-col>
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/临沂大学.png">
                <div class="section">
                    <h1 class="title1">临沂大学</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;临沂大学（Linyi
                        University），简称临大（LYU），位于山东省临沂市；是山东省省属的综合性大学， 国家发改委“产教融合”项目重点建设高校， 山东省应用型人才特色培养工程”重点建设大学，“卓越教师培养计划”实施高校，CDIO
                        工程教育联盟成员单位，数据中国“百校工程”项目院校。 
                        学校创办于1941年，与抗大一分校与中共滨海地委共同创建的滨海建国学院一脉相承，后多次迁徙合并，历经滨海公学、临沂第一师范、临沂教育学院、临沂师范学院等发展阶段，2010年经教育部批准更名为临沂大学。
                        截至2023年5月，学校占地约6000亩，在沂水、费县设分校区，校舍面积116万余平方米，固定资产总值48亿元，教学科研仪器设备总值5.79亿元，馆藏纸质文献492余万册，中外文数据库70个；设有24个学院、5个校级研究机构、5个教辅机构和4个直属机构，
                        开设76个本科专业、16个专科（高职）专业 ，涵盖11大学科门类；化学、工程学、植物和动物科学学科进入ESI全球排名前1%学科榜单  ；拥有5个硕士授权一级学科、11个硕士专业学位授权类别；有教职工2841人，全日制在校生4.5万余人，其中硕士研究生780人、国际学生150余人。
                    </h4>
                </div>
            </van-col>
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/青岛理工大学.png">
                <div class="section">
                    <h1 class="title1">青岛理工大学</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp; 青岛理工大学（Qingdao University of
                        Technology），位于山东省青岛市，是山东省重点培养大学、山东省高水平大学“强特色”建设高校，山东省重点建设的应用基础型人才培养特色名校。具有研究生推免资格，入选国家“111计划”、卓越工程师培养计划、全国“三全育人”综合改革试点单位、“全国首批深化创新创业教育改革示范高校”，是首批山东省“高峰学科”、“优势特色学科”及“省一流学科”建设高校，CDIO
                        工程教育联盟成员。
                        学校创建于1952年，先后隶属原重工业部、原冶金工业部，1998年划转山东省领导，实行“中央与地方共建，以地方管理为主”管理体制。先后历经山东冶金学院、青岛建筑工程学院时期，2004年更名为青岛理工大学。1960年开始招收本科生，1993年获批硕士学位授予权单位，2005年获批博士学位授予权单位。
                        截至2023年3月，学校辖市北、黄岛、临沂3个校区，占地面积约217.15万平方米，校舍建筑面积约110.68万平方米，图书馆藏书约260.1万册，教学科研仪器设备总值约5.72亿元；设有18个教学院部， 开设63个本科专业；拥有2个一级学科博士后科研流动站、2个博士学位授权一级学科、1个专业博士授权学科点、21个硕士学位授权一级学科、16个专业硕士学位点；有教职工2594人，其中专任教室1783人，全日制在校生33635人。
                    </h4>
                </div>
            </van-col>
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/山东第一医科大学.png">
                <div class="section">
                    <h1 class="title1">山东第一医科大学</h1>
                    <h4 class="title2">
                        &ensp;&ensp;&ensp;&ensp; 山东第一医科大学（山东省医学科学院）是山东省重点建设的大学，也是山东省医学科学研究机构，是第一批卓越医生教育培养计划项目试点高校、山东特色名校工程立项建设单位，由山东省教育厅、省卫生健康委、济南市人民政府实施“省市共建”。 
                        校（院）是2018年11月经教育部批准由泰山医学院、山东省医学科学院、山东省立医院、山东省千佛山医院等资源整合组建而成的。泰山医学院的前身是山东医学院楼德分院，1981年定名为泰山医学院；山东省医学科学院成立于1958年；山东省立医院起源于1897年德国天主教会创办万国缔盟博爱恤兵会医院，先后被日本、国名政府、中国人民解放军接管，中华人民共和国成立后先后更名为山东省立第一医院、山东省人民医院、山东省立医院；山东省千佛山医院成立于1960年，为山东大学齐鲁医学院临床学院、山东省慈善医院。
                        根据2023年5月学校官网信息显示，校（院）在济南、泰安设有校区，在济南、青岛、济宁等地建有研究机构，总占地面积6000余亩；设有32个教学机构，5个科研机构和5个教辅机构；拥有45个本科专业，1个博士后科研工作站、1个一级学科博士学位授权点、9个二级学科博士学位授权点、9个一级学科硕士学位授权点，共94个硕士学位授权点；在校全日制学生25000余人，其中本科生22000余人、研究生3300余人、留学生400余人；校（院）有在职职工19198人（含附属医院）。
                    </h4>
                </div>
            </van-col>
            <van-col span="12" class="school-item">
                <img class="school-image" src="@/assets/images/山东交通学院.png">
                <div class="section">
                    <h1 class="title1">山东交通学院</h1>
                    <h4 class="title2">
                        &ensp;&ensp;&ensp;&ensp; 山东交通学院（ShanDong JiaoTong
                        University），位于山东省济南市，是中华人民共和国交通运输部与山东省人民政府共建高校，为“山东特色名校工程”重点建设的应用型人才培养特色高校，教育部“应用科技大学改革试点战略研究”项目首批试点院校，教育部首批新工科研究与实践项目入选高校。2017年，学校成为山东省省级硕士立项建设单位。2019年，获批山东省文明校园；2020年入选山东省“高水平学科”建设高校。2021年，获批山东省应用型本科高校建设首批支持单位。
                        学院始建于1956年，时为交通部济南汽车机械学校；1958年，更名山东交通专科学校；1962年，更名济南交通学院；1970年，更名地方国营济南卫东机械厂；1973年，更名为山东省交通学校；1980年，更名为交通部济南交通学校；1988年，更名为交通部济南交通高等专科学校；2002年，济南交通专科学校与中国重汽集团职工大学合并组建山东交通学院。
                        截至2023年6月，学校设立济南长清校区、无影山校区、东校区和威海校区4个校区，在临沂市和威海市设有独立法人研究院，占地面积3200余亩，建筑面积98万余平方米，教学科研仪器设备总值4.2亿余元，馆藏纸质藏书220万余册，电子期刊140万余册；设有19个学院（部），开设53个本科招生专业；有教职工近1900人，全日制在校本专科学生23000余人，研究生700余人，在读国际学生80余人。
                    </h4>
                </div>
            </van-col>
        </div>
        <div class="schoold-list2">
            <div class="school-item">
                <img class="school-image" src="@/assets/images/滨州学院.png">
                <div class="section">
                    <h1 class="title1">滨州学院</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;滨州学院（Binzhou
                        University），位于山东省滨州市，是由山东省人民政府举办、教育部批准成立的一所全日制普通本科院校，由山东省教育厅、滨州市人民政府共建，是山东省硕士学位授予A类立项建设单位。
                        学院前身是始建于1954年的北镇师范学校；1983年更名为滨州师范专科学校；2004年5月，经教育部批准，改建为滨州学院。 2021年1月，学校获批山东省应用型本科高校建设首批支持单位。2021年10月，学校正式成为硕士学位授予单位
                        截至2023年6月，学校占地面积133.15万平方米，校舍建筑面积56.71万平方米，教学科研仪器设备总值2.9亿元，图书馆纸质图书197.36万册，电子图书126.17万册；设有二级学院19个、直属科研机构3个，开设本科专业59个、本科中外合作办学项目2个；拥有硕士专业学位点2个；有专任教师1119人，全日制普通在校生18000余人。
                    </h4>
                </div>
            </div>
            <div class="school-item">
                <img class="school-image" src="@/assets/images/菏泽学院.png">
                <div class="section">
                    <h1 class="title1">菏泽学院</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;菏泽学院（Heze
                        University）位于山东省菏泽市，是一所全日制普通本科高校，是数据中国“百校工程”项目建设院校， 由山东省教育厅与菏泽市人民政府共建。] 
                        菏泽学院的前身是创建于1949年的冀鲁豫区第二师范学校，历史上曾更名为平原省立菏泽师范学校、山东省菏泽第一师范学校、菏泽师范专科学校。2002年，菏泽师范专科学校、菏泽教育学院、菏泽广播电视大学3所学校合并，同时并入菏泽师范学校、菏泽农业学校，筹建菏泽学院。2004年，教育部正式批准更名为菏泽学院。2011年，单县幼儿师范学校、郓城幼儿师范学校并入菏泽学院。2017年，学校成为省级硕士培育建设单位。
                        截至2023年6月，学校建有4个校区，占地面积1436亩，建筑面积63万余平方米，教学科研仪器设备总值2.3亿元，馆藏纸质图书231万册、期刊279种，电子图书252万册；设有21个教学单位，开设66个本科专业；有在职教职工1696人，其中专任教师1211人，全日制本专科在校生2.6万余人。
                    </h4>
                </div>
            </div>
            <div class="school-item">
                <img class="school-image" src="@/assets/images/临沂大学.png">
                <div class="section">
                    <h1 class="title1">临沂大学</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp;临沂大学（Linyi
                        University），简称临大（LYU），位于山东省临沂市；是山东省省属的综合性大学， 国家发改委“产教融合”项目重点建设高校， 山东省应用型人才特色培养工程”重点建设大学，“卓越教师培养计划”实施高校，CDIO
                        工程教育联盟成员单位，数据中国“百校工程”项目院校。 
                        学校创办于1941年，与抗大一分校与中共滨海地委共同创建的滨海建国学院一脉相承，后多次迁徙合并，历经滨海公学、临沂第一师范、临沂教育学院、临沂师范学院等发展阶段，2010年经教育部批准更名为临沂大学。
                        截至2023年5月，学校占地约6000亩，在沂水、费县设分校区，校舍面积116万余平方米，固定资产总值48亿元，教学科研仪器设备总值5.79亿元，馆藏纸质文献492余万册，中外文数据库70个；设有24个学院、5个校级研究机构、5个教辅机构和4个直属机构，
                        开设76个本科专业、16个专科（高职）专业 ，涵盖11大学科门类；化学、工程学、植物和动物科学学科进入ESI全球排名前1%学科榜单  ；拥有5个硕士授权一级学科、11个硕士专业学位授权类别；有教职工2841人，全日制在校生4.5万余人，其中硕士研究生780人、国际学生150余人。
                    </h4>
                </div>
            </div>
            <div class="school-item">
                <img class="school-image" src="@/assets/images/青岛理工大学.png">
                <div class="section">
                    <h1 class="title1">青岛理工大学</h1>
                    <h4 class="title2">&ensp;&ensp;&ensp;&ensp; 青岛理工大学（Qingdao University of
                        Technology），位于山东省青岛市，是山东省重点培养大学、山东省高水平大学“强特色”建设高校，山东省重点建设的应用基础型人才培养特色名校。具有研究生推免资格，入选国家“111计划”、卓越工程师培养计划、全国“三全育人”综合改革试点单位、“全国首批深化创新创业教育改革示范高校”，是首批山东省“高峰学科”、“优势特色学科”及“省一流学科”建设高校，CDIO
                        工程教育联盟成员。
                        学校创建于1952年，先后隶属原重工业部、原冶金工业部，1998年划转山东省领导，实行“中央与地方共建，以地方管理为主”管理体制。先后历经山东冶金学院、青岛建筑工程学院时期，2004年更名为青岛理工大学。1960年开始招收本科生，1993年获批硕士学位授予权单位，2005年获批博士学位授予权单位。
                        截至2023年3月，学校辖市北、黄岛、临沂3个校区，占地面积约217.15万平方米，校舍建筑面积约110.68万平方米，图书馆藏书约260.1万册，教学科研仪器设备总值约5.72亿元；设有18个教学院部， 开设63个本科专业；拥有2个一级学科博士后科研流动站、2个博士学位授权一级学科、1个专业博士授权学科点、21个硕士学位授权一级学科、16个专业硕士学位点；有教职工2594人，其中专任教室1783人，全日制在校生33635人。
                    </h4>
                </div>
            </div>
            <div class="school-item">
                <img class="school-image" src="@/assets/images/山东第一医科大学.png">
                <div class="section">
                    <h1 class="title1">山东第一医科大学</h1>
                    <h4 class="title2">
                        &ensp;&ensp;&ensp;&ensp; 山东第一医科大学（山东省医学科学院）是山东省重点建设的大学，也是山东省医学科学研究机构，是第一批卓越医生教育培养计划项目试点高校、山东特色名校工程立项建设单位，由山东省教育厅、省卫生健康委、济南市人民政府实施“省市共建”。 
                        校（院）是2018年11月经教育部批准由泰山医学院、山东省医学科学院、山东省立医院、山东省千佛山医院等资源整合组建而成的。泰山医学院的前身是山东医学院楼德分院，1981年定名为泰山医学院；山东省医学科学院成立于1958年；山东省立医院起源于1897年德国天主教会创办万国缔盟博爱恤兵会医院，先后被日本、国名政府、中国人民解放军接管，中华人民共和国成立后先后更名为山东省立第一医院、山东省人民医院、山东省立医院；山东省千佛山医院成立于1960年，为山东大学齐鲁医学院临床学院、山东省慈善医院。
                        根据2023年5月学校官网信息显示，校（院）在济南、泰安设有校区，在济南、青岛、济宁等地建有研究机构，总占地面积6000余亩；设有32个教学机构，5个科研机构和5个教辅机构；拥有45个本科专业，1个博士后科研工作站、1个一级学科博士学位授权点、9个二级学科博士学位授权点、9个一级学科硕士学位授权点，共94个硕士学位授权点；在校全日制学生25000余人，其中本科生22000余人、研究生3300余人、留学生400余人；校（院）有在职职工19198人（含附属医院）。
                    </h4>
                </div>
            </div>
            <div class="school-item">
                <img class="school-image" src="@/assets/images/山东交通学院.png">
                <div class="section">
                    <h1 class="title1">山东交通学院</h1>
                    <h4 class="title2">
                        &ensp;&ensp;&ensp;&ensp; 山东交通学院（ShanDong JiaoTong
                        University），位于山东省济南市，是中华人民共和国交通运输部与山东省人民政府共建高校，为“山东特色名校工程”重点建设的应用型人才培养特色高校，教育部“应用科技大学改革试点战略研究”项目首批试点院校，教育部首批新工科研究与实践项目入选高校。2017年，学校成为山东省省级硕士立项建设单位。2019年，获批山东省文明校园；2020年入选山东省“高水平学科”建设高校。2021年，获批山东省应用型本科高校建设首批支持单位。
                        学院始建于1956年，时为交通部济南汽车机械学校；1958年，更名山东交通专科学校；1962年，更名济南交通学院；1970年，更名地方国营济南卫东机械厂；1973年，更名为山东省交通学校；1980年，更名为交通部济南交通学校；1988年，更名为交通部济南交通高等专科学校；2002年，济南交通专科学校与中国重汽集团职工大学合并组建山东交通学院。
                        截至2023年6月，学校设立济南长清校区、无影山校区、东校区和威海校区4个校区，在临沂市和威海市设有独立法人研究院，占地面积3200余亩，建筑面积98万余平方米，教学科研仪器设备总值4.2亿余元，馆藏纸质藏书220万余册，电子期刊140万余册；设有19个学院（部），开设53个本科招生专业；有教职工近1900人，全日制在校本专科学生23000余人，研究生700余人，在读国际学生80余人。
                    </h4>
                </div>
            </div>
        </div>
    </div>
</template>
  
<script>
export default {
    name: 'schoold',
    data() {
        return {
        }
    }
}
</script>
<style scoped>
.school-image {
    width: 100%;
}

.school {
    padding-top: 90px;
    overflow: scroll;
}

.title1 {
    text-align: center;
}

.title2 {
    margin-left: 20px;
    margin-right: 20px;
}

.schoold-list2 {
    display: none;
}

.schoold-list {
    display: flex;
    flex: 0 1 40%;
    flex-wrap: wrap;
}
.schoold-list .school-item {
    padding-right: 30px;
    padding-left: 30px;
}

@media (max-width: 1200px) {
    .schoold-list2 {
        display: block;
    }
    .schoold-list {
        display: none;
    }
}
</style>